# Localization for project #2.

TXT_TASK = 'Вам будет предложено несколько утверждений, касающихся основ' \
           ' программирования.\nЕсли вы считаете утверждение верным, введите ' \
           '"true", если вы считаете утверждение неверным, введите "false"' \
           ' (Допустимо написание символов в любом регистре).'

TXT_STATEMENT = 'Утверждение'

TXT_STATEMENT1 = 'Согласно PEP8, рекомендованная максимальная длина строки - 79 ' \
                 'символов.'
TXT_STATEMENT2 = 'float() отвечает за вещественные числа.'
TXT_STATEMENT3 = 'str - обозначение строки.'
TXT_STATEMENT4 = 'Оператор // производит целочисленное деление.'
TXT_STATEMENT5 = 'If-elif-else используются для создания циклов.'
TXT_STATEMENT6 = '''Вывод программы print('привет', 'мир', sep='') - приветмир.'''
TXT_STATEMENT7 = 'round() производит "Банковское округление", то есть округление' \
                 ' к ближайшему чётному.'
TXT_STATEMENT8 = 'Оператор ** можно использовать как для возведения в степень,' \
                 ' так и для выделения корней.'
TXT_STATEMENT9 = 'Вывод программы turtle.circle(50, extent = 30) - дуга окружности.'
TXT_STATEMENT10 = 'Python произносится по-русски как "питон".'
TXT_STATEMENT11 = 'По PEP8 импорты всегда помещаются в конце файла.'
TXT_STATEMENT12 = 'Оператор % используется для вычисления остатка от деления.'

TXT_CONCLUSION = 'Вы освоили курс "Знакомство с языком Python" на'
TXT_GREATRESULT = 'Отличный результат! Продолжайте в том же духе и вы сможете' \
                  ' достигнуть уровня Гвидо Ван Россума!'
TXT_GOODRESULT = 'Неплохой результат! Вам следует почитать PEP8 и порешать' \
                 ' задания на "Hellopython.ru" на досуге.'
TXT_BADRESULT = 'Вам следует серьёзнее относиться к предмету. Все ресурсы' \
                ' Интернета вам в помощь.'
